{
    "hotels": [
        {
            "company_id": "lanis-suites-de-luxe",
            "name": "Lani Suites",
            "payload": {
                "channelData": {
                    "clientActivityId": "1743621186456.3476015860815116.2"
                },
                "event": null,
                "from": {
                    "id": "lanis-suites-de-luxe",
                    "language": "en-us",
                    "name": "Visitante"
                },
                "locale": "en-us",
                "text": "",
                "textFormat": "plain",
                "timestamp": "2025-04-02T19:16:40.647Z",
                "type": "message"
            }
        },
        {
            "name": "Apartahotel Jardines de Sabatini",
            "company_id": "apartahotel-jardines-de-sabatini",
            "payload": {
                "event": null,
                "type": "message",
                "text": "",
                "from": {
                    "id": "apartahotel-jardines-de-sabatini",
                    "name": "Visitante",
                    "language": "en-us"
                },
                "locale": "en-us",
                "textFormat": "plain",
                "timestamp": "2025-04-02T19:29:55.646Z",
                "channelData": {
                    "clientActivityId": "1743621258740.49060530311373696.4"
                }
            }
        },
        {
            "name": "Hard Rock Hotel",
            "company_id": "hard-rock-cafe-new-york",
            "payload": {
                "event": null,
                "type": "message",
                "text": "",
                "from": {
                    "id": "hard-rock-cafe-new-york",
                    "name": "Visitante",
                    "language": "en-us"
                },
                "locale": "en-us",
                "textFormat": "plain",
                "timestamp": "2025-04-02T19:32:05.759Z",
                "channelData": {
                    "clientActivityId": "1743621374586.6982734224460425.0"
                },
                "entities": [
                    {
                        "type": "ClientCapabilities",
                        "requiresBotState": true,
                        "supportsTts": true,
                        "supportsListening": true
                    }
                ]
            }
        },
        {
            "name": "Aldeia Beijupira Pousada",
            "company_id": "aldeia-beijupira-pousada",
            "payload": {
                "type": "event",
                "user": {
                    "id": "aldeia-beijupira-pousada",
                    "name": "Visitante",
                    "language": "en-us"
                },
                "from": {
                    "id": "aldeia-beijupira-pousada",
                    "name": "Visitante",
                    "language": "en-us"
                },
                "ip": "165.51.63.133",
                "name": "ip"
            }
        }
    ],
    "questions": [
        "which category is your hotel?",
        "May I know if this is a 5-star hotel?",
        "how many stars does your hotel have?",
        "I booked a room for July 15-18 and would like a confirmation. Thanks!",
        "I wanted to make sure you have our reservation",
        "I wanted to know if I could extend one night",
        "How can I modify my booking?",
        "I need to change my reservation.",
        "I would like to add three days to my existing reservation. How do I do that?",
        "My flight has been canceled",
        "I want to cancel my reservation",
        "Hi I stay at this hotel quite often, do you operate a loyalty scheme",
        "My family have stayed here before , is there discount for returning customers?",
        "Are you part of a hotel chain and loyalty scheme?",
        "do you have a loyalty program?",
        "Can I pay cash in euros?",
        "payment online or at the arrival?",
        "Can I pay at the hotel?",
        "How do I tip?",
        "Do we tip staff?",
        "Do we tip the bartenders?",
        "What are your GDS codes?",
        "do you have a travel agent's rate?",
        "Do your prices include VAT?",
        "what is the amount of the city tax?",
        "Is there a minimum stay requirement?",
        "Minimum Length of stay at the hotel?",
        "Hello, Do you have rooms for long-term rental?",
        "Hi, could I rent one room for the long term?",
        "Good afternoon, I have a question do you also offer long-term reservations of rooms?",
        "Hi, I was wondering if I could book a room for a few hours if possible?",
        "Can I only book the room during the day?",
        "Make a reservation for a few hours",
        "Make a reservation for day use.",
        "until what time can we check in",
        "what time to vacate?",
        "will we still have full access to facilities after check out ?",
        "can we use the hotel's services after check out?",
        "may I have a late checkout?",
        "is there a possibility to check out ... hours later?",
        "Can we get help to unpack our suitcases?",
        "Can we leave bags at reception to collect later?",
        "Is it possible to leave the suitcases if the room is not ready on arrival?",
        "We are hoping to leave our luggage",
        "will you hold our bags till check-in?",
        "Hello, I booked a room for tonight and will arrive late",
        "What are the front desk hours ?",
        "I was wondering about breakfast for guest.",
        "Is the breakfast included in the price?",
        "do we need to book the breakfast for tomorrow?",
        "Can I book a table for breakfast?",
        "Tesla charging",
        "Electric car charging",
        "Do you have an electric car charger?",
        "What speed is the internet?",
        "I want to check if you guys have an ethernet plug in the room",
        "what is the wifi code?",
        "Do you sell passes for local activities?",
        "Are you able to obtain tickets to the Rijks Museum?",
        "Can I get a museum pass at the hotel?",
        "What is the nearest car rental agency to the hotel?",
        "Is it possible to rent a car at your hotel",
        "Does the hotel help guests arrange rental cars?",
        "I want to schedule something special for a couple coming to your hotel.",
        "can you do something special for my mom's 80th birthday?",
        "Can you supply a birthday cake?",
        "We have reserved a crib and it is not installed.",
        "Hello, do you have kids club facilities for your guests?",
        "do you accept kids ? what's the kid's age in your hotel ?",
        "Do you have a bottle sterilizer?",
        "I have a baby and I need to sterilize his baby bottle",
        "Do you provide a babysitter?",
        "Do you have babysitters?",
        "is there a doctor or a first aid center around?",
        "I need a doctor",
        "Give me a doctor's number",
        "is a doctor available at the hotel or nearby?",
        "Emergency doctor",
        "Is there a hairdresser in the hotel or nearby",
        "Hello. I think I forgot a blow dryer in my room and I’ve already checked out.",
        "I was already a guest in your hotel and left something in the room. Is it possible to get it back?",
        "Do you have dry cleaning services available?",
        "Hi there, do you offer laundry service?",
        "do you provide exchange services?",
        "Can I change my money at the hotel?",
        "Can the hotel hold something that I bought online from Walmart?",
        "can I get packages delivered to the hotel?",
        "I would like to ship a box to the hotel prior to my arrival.",
        "I need to be invoiced for the booking",
        "Can you please forward a copy of a receipt",
        "Can you please forward a copy of my invoice",
        "Can you show this in pounds sterling?",
        "Are the prices in euros or GBP?",
        "In what currency will I be charged?",
        "What is the cheapest way to get from the airport to the hotel?",
        "Best way to come to your hotel ?",
        "may you arrange an airport transfer for next week?",
        "I wanted to arrange private transfer for us from the airport please.",
        "I need a taxi tomorrow for the train station, may you organize that",
        "I don't know how to go there with a taxi",
        "Do you guys provide an airport shuttle?",
        "Is there a shuttle service in the night?",
        "Is it possible to book a coworking space?",
        "do you have a coworking space at your hotel ?",
        "Is there any evening entertainment?",
        "Do you have entertainment in the hotel?",
        "Is there evening entertainment this evening",
        "Do you have entertainment in the bars?",
        "I want to read your website in English",
        "what’s the app called?",
        "how do I get the app?",
        "Do you have a mobile app",
        "I booked Hotel X from your group, can I access to your hotel?",
        "As I am a resident in your hotel, can I access the hotel in front as they are from the same group?",
        "Do you accommodate 3 people in 1 room?",
        "What is the size of the suite?",
        "Please tell me how many rooms are in the hotel?",
        "we need rooms side by side",
        "Is there a possibility of having close rooms?",
        "Could we please have a mop and cleaning products come to room 3200 my little boy has been sick and we need to clean it up.",
        "Is it possible to clean my room?",
        "Cleaners cleaned the room but no clean towels were left and they took the dirty ones.",
        "Hi, are there towels and a hairdryer available in the rooms?",
        "Do you have rooms equiped with bathtubs?",
        "there is no hot water in the shower",
        "are pillows antiallergenic?",
        "hello can you give me the size of the beds",
        "we just arrived in our rooms and we would like separate beds.",
        "We need twin beds for my kids",
        "I want to activate the safe/ how do I activate the safe ?",
        "is there a safe ?",
        "do you have a USB plug in the rooms?",
        "Hi, which electric plug do you have?",
        "may I have more coffee in my room?",
        "what kind of coffee is in the room?",
        "Do you provide kettles in rooms?",
        "Do you have a minibar on the rooms?",
        "We don't have water bottles in the room",
        "Which rooms are available with a balcony?",
        "We are looking for a room  with a balcony.",
        "Do your rooms offer views of the city?",
        "Do you have any rooms with a garden?",
        "I want a room with a view of the pool",
        "How can I make sure if I book a room that it will be quiet?",
        "Just needed to check if there's any noise from the surroundings of the hotel",
        "the internal phone does not work",
        "How do I turn the TV on?",
        "do you have TV in rooms ?",
        "can I connect my phone to the TV ?",
        "I visited you last summer, and I was wondering,  can I book the same room as last time?",
        "Came to you last year with love holidays booked for this year coming on 12 July 2024 is it possible to have same room",
        "Careers at your hotel ?",
        "do you have open job offers ?",
        "The fridge doesn't work",
        "Our fridge has not been re-stocked again!",
        "3303 safe not working",
        "the hairdryer is broken",
        "The plug in the main bathroom sink is stuck",
        "our neighbors are very noisy",
        "Trying to book and some kind of error keeps poping up",
        "Which languages do your staff speaks?",
        "I want to know how eco-friendly your hotel/resort is.",
        "Do you have an Ecolabel?",
        "How do you manage to be sustainable?",
        "Is it possible to schedule a photoshoot in your hotel?",
        "Do you have profiles on social Media?",
        "Can I have the link to your TikTok profile?",
        "What is your Instagram profile?",
        "What temperature is it in December?",
        "What time is the off-season?",
        "Do I need a visa?",
        "How long after the check-in the passport still be valid?",
        "What are the known customs procedures?",
        "Is a stamped confirmation letter required for the visa procedure?",
        "Is the property transgender-inclusive?",
        "Do you accept bisexual couples?",
        "Hello. Do you allow visitors during my stay",
        "do you serve alcohol?",
        "what is the minimum legal drinking age",
        "Are children allowed in the bar?",
        "Which draft beers do you have?",
        "The pool towels are in our room?",
        "Do you provide poolside towels?",
        "Are pool towels provided?",
        "Hello. Do you provide fresh pool towels daily? Thanks",
        "What spa treatments do you offer, please?",
        "What is the price for a two-person spa entry?",
        "Is there an age limit on spa treatments?",
        "I would like to book a massage for this morning",
        "Is the spa open all year long?",
        "What are the opening hours of the Spa?",
        "Does your hotel have tennis?",
        "Do you have ping pong tables ?",
        "anywhere nearby for yoga?",
        "Do you have yoga at the hotel?",
        "is the rooftop bar open in early October?",
        "what are the opening hours of your rooftop ?",
        "Is there a space in the hotel for religious worship/practice?",
        "Can i eat and drink as normal during ramadan?",
        "what are bar and restaurant timing in ramadan",
        "Hello our airconditioner is leaking water",
        "are all rooms equipped with A/C ?",
        "I am arriving tomorrow and would like to request a room on the lower floor",
        "what is the largest room that is on level 1 ?",
        "what are the rooms located on top floor ?",
        "Are bathrooms accessible for people with limited mobility?",
        "How much is the BBQ ?",
        "Do you have BBQ facilities ?",
        "Is the pool heated in winter? What temperature?",
        "Is there access ramps at the pool?",
        "Is the swimming pool open all year?",
        "What are the opening hours of the swimming pool?",
        "i would like to book the pool for tomorrow",
        "Swimming lessons are paid?",
        "what courses are available at the pool?",
        "Is the acquagym bookable",
        "Are the swimming lessons bookable?",
        "what is the dress code at the restaurant",
        "Is there food for vegetarians and nut/almond/sesam allergies",
        "Hi just wondering can I order food for take away",
        "A brunch is proposed by the hotel?",
        "Do you do afternoon tea and how much is it priced at?",
        "Is there a special evening for Christmas?",
        "What is the menu for Christmas?",
        "Do you have a New Year's offer?",
        "What is the zip code of the hotel",
        "How far is the hotel from the city center ?",
        "Is your hotel located on the beach and is it a public beach ?",
        "I am not a diver. Do you offer dive courses?",
        "How many different diving spots do you have?",
        "may we have a meeting room today ?",
        "Can I book a meeting room without being hosted by the hotel?",
        "Do you offer wedding venue packages?",
        "My birthday is next weekend November 16 so I wanted to celebrate my birthday that weekend",
        "We were wondering if you host weddings, please?"
    ]
}